%% Л.Р. №3 - Исследование цифрового резонатора

clear; clc; close all;
%% %%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%% %%
%% ЗАДАНИЕ

a=0.5; %модуль полюса от -0.99 до 0.99
w=0; %аргумент полюса от 0 до pi

%опционально число расчетных точек для ЧХ
n=64;

%% %%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%% %%
%% ОСНОВНАЯ ПРОГРАММА

%расчет ПФ резонатора
z=tf('z',-1);
H=(1-a)/2*(1-z^-2)/(1-(a+1)*cos(w)*z^-1+a*z^-2);

%выделение коэффициентов
b=cell2mat(H.num);
a1=cell2mat(H.den);

%графики
figure('Name','Исследование цифрового Резонатора','NumberTitle','off');
subplot(2,2,1);pzplot(H);title 'Карта нулей-полюсов';
xlabel('Вещественная ось');ylabel('Мнимая ось');
subplot(2,2,2);impz(b,a1);title 'Импульсная характеристика';
xlabel('Отсчеты');ylabel('Амплитуда');grid on;
subplot(2,2,3);
[h1,w1]=freqz(b,a1,n);
bar(w1,abs(h1));title 'Амплитудно-частотная характеристика';
xlabel('Частота F');grid on;
subplot(2,2,4);bar(w1,angle(h1));title 'Фазочастотная характеристика';
xlabel('Частота F');grid on;
