%% Л.Р. №4 - КИХ-фильтры - метод временных окон

clear; clc; close all;
%% %%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%% %%
%% ЗАДАНИЕ

Fs=12500; %частота среза
Fd=120000; %частота дискретизации
N=42; %порядок фильтра
ftype = 'low'; %тип фильтра

%дополнительно
beta=1;%бета-параметр окна Кайзера

%окно
win=kaiser(N+1,beta);%окно Кайзера
F=Fs/(Fd/2);%нормировка частоты среза по частоте Найквиста

%% %%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%% %%
%% ОСНОВНАЯ ПРОГРАММА

%ФНЧ
b=fir1(N,F,ftype,win); %коэффициенты фильтра взвешенного
b1=fir1(N,F,ftype,rectwin(N+1)); %коэффициенты фильтра без взвешивания

%графики
grf1=fvtool(b,1);
grf2=fvtool(b1,1);
legend(grf1, 'ВЗВЕШЕННАЯ');
set(grf1,'NormalizedFrequency','off','Fs',Fd);
legend(grf2, 'БЕЗ ВЗВЕШИВАНИЯ');
set(grf2,'NormalizedFrequency','off','Fs',Fd);
