%% Л.Р. №4 - КИХ-фильтры - метод Ремеза

clear; clc; close all;
%% %%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%% %%
%% ЗАДАНИЕ

Fd=1000;%частота дискретизации
F=[50 100 400 450];%граничные частоты
m=[0 1 0];%вектор значений АЧХ
d1=0.05;%допустимое отклонение ПП
d2=0.1;%допустимое отклонение ПЗ

%% %%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%% %%
%% ОСНОВНАЯ ПРОГРАММА

%расчет порядка фильтра
[N,f0,a0,w]=firpmord(F,m,[d2 d1 d2],Fd);

%расчет коэффициентов фильтра
b=remez(N,f0,a0,w,'hilbert');

%графики
grf=fvtool(b,1);
set(grf,'NormalizedFrequency','off','Fs',Fd);
