%% Л.Р. №5 - БИХ-фильтры - пример расчета режекторного фильтра Кауэра

clear; clc; close all;
%% %%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%% %%
%% ЗАДАНИЕ
Fd=16000;%частота дискретизации
Fpp=[1000 2400];%границы ПП
Fpz=[1400 2000];%границы ПЗ
rp=0.4455;%максимальные пульсации в ПП
rs=40;%минимальное отклонение в ПЗ

%нормирование частот
Wp=Fpp/(Fd/2);
Ws=Fpz/(Fd/2);

%расчет минимального порядка
[N,Wn]=ellipord(Wp,Ws,rp,rs);

%синтез фильтра
[b,a]=ellip(N,rp,rs,Wn,'stop');

%графики
grf=fvtool(b,a);
set(grf,'NormalizedFrequency','off','Fs',Fd);
