%% Л.Р. №6 - Пример цифровой фильтрации с помощью БПФ в MATLAB
%%%%%%%%%%%% Исходные данные:
%%%%%%%%%%%% Сигнал: Гауссовский импульс
%%%%%%%%%%%% Фильтр: ФНЧ Кайзера
%%%%%%%%%%%% В программе к сигналу добавляется аддитивный Гауссовский шум

clear; clc; close all;
%% %%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%% %%
%% ЗАДАНИЕ

N=1024; %размерность БПФ
%сигнал
A=1; %амплитуда колокола
a=0.1; %ширина колокола
T=1; %предел колокола
Td=0.03*T; %шаг дисктеризации гауссовского испульса
%расчет сигнала
ts=[-T:Td:T];
St=A*exp(-ts.^2/(2*a^2));

%фильтр
n=6; %порядок фильтра
Fs=300; %частота среза фильтра
Fd=700; %частота дискретизации фильтра
%расчет фильтра
beta=1;%бета-параметр окна Кайзера
win=kaiser(n+1,beta);%окно Кайзера
F=Fs/(Fd/2);%нормировка частоты среза по частоте Найквиста
b=fir1(n,F,'low',win); %коэффициенты фильтра 

%добавление шума в сигнал
X=St+0.1*A*randn(size(ts));

%% %%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%% %%
%% ОСНОВНАЯ ПРОГРАММА

%цифровая фильтрация
Spb=fft(rot90(impz(b),-1),N);%БПФ ИХ фильтра
Sps=fft(X,N);%БПФ зашумленного сигнала
Sout=ifft(Sps.*rot90(Spb,2));%отфильтрованный сигнал

%графики сигнала
figure('Name','Сигналы','NumberTitle','off');
subplot(2,2,1); bar(St);title 'Заданный сигнал'; grid on;
subplot(2,2,2); bar(X);title 'Зашумленный сигнал'; grid on;
subplot(2,2,3); bar(impz(b));title 'ИХ Фильтра'; grid on;
subplot(2,2,4); bar(Sout);title 'Сигнал после фильтрации'; grid on;
axis([0 length(X) min(X) max(X)]);

%спектры
figure('Name','Спектры','NumberTitle','off');
subplot(2,2,1); stem(abs(Sps));title 'Амплитудный спектр сигнала'; grid on;
subplot(2,2,2); stem(angle(Sps));title 'Фазовый спектр сигнала'; grid on;
[H22,w22]=freqz(b,1,N);
subplot(2,2,3); stem(w22,abs(H22));title 'АЧХ фильтра'; grid on;
subplot(2,2,4); stem(w22,angle(H22));title 'ФЧХ фильтра'; grid on;
